system-rules.org
* Outline of paper
** Motivation
   There is an interest in removing formulas with their many logical
   connectives and introduction rules with simple inference rules.

   There are limitations to that effort.  It has been formalized well
   in natural deduction (LF, PS-H).  In sequent calculus (which can be
   seen as subsuming the natded setting), is more complex.  There are
   more structures to witness: additive/multiplicative, pos/neg
   polarity of connectives and atomic formulas, bounded/unbounded
   zones in sequents, etc.

   We will attempt to capture many of these features also in inference
   rules, although this will require us to extend the syntax of
   inference rules.  We will probably also limit ourselves to N3
   formulas: higher-levels of polarity nesting is possible but that
   would probably strain the nature of inference rules too much.

   We use focusing to describe the general setting.

** Prior related work
    - PS-H's paper on a natural extension to ND.
    - Aaron's "Gentzenizing Schroeder-Heister".
    - Harper, Honsell, Plotkin. LF.
    - Negri and others (axioms to inference rules)
    - Ciabattoni and Genco, ToCL 2018, "Hypersequents and Systems of
      Rules: Embeddings and Applications".  Elaine says that they
      show transformations between
      + Hypersequents <-> 
        System of rules in Sequent calculus <->
        Natural Deduction.
    - Ciabattoni, Galatos, Terui: From Axioms to Analytic Rules in
      Nonclassical Logics. LICS 2008: Structural rules and the
      polarity hierarchy.
** Use focusing, but this time, go beyond bipoles
*** Fix on LJF and LKF

    Stress that cut elimination results can follow automatically for
    correctly designed proof systems.  Discussing the cut rule is very
    important in this abstract.

    WARNING Given the use of higher-order-like quantification, we
    might not have the subformula property even when we technically
    have cut-free proofs.  See notes below from meeting with Revantha.

    Observations to make explicitly (about nesting of polarities)

    1. If we decide on a formula in N_n then the asynchronous phase
       deals with formulas in P_(n-1) and we finally get formulas
       stored in N_(n-2).  In particular, if we decide on Horn clauses
       (N_1) then no formulas are stored: there is no changes to the
       LHS.

    2. If B has only implications, then B is of order n (in the
       type-theory sense) then B is in B_n.

*** Storage includes non-atomic formulas
    Usually, decide rules on the underlying theory or on stored atomic
    formulas.  Now, there will be stored formulas which will yield
    inference rules of their own.  Given the formula-as-rule analogy
    (avoid saying axiom-as-rule), then it is natural and immediate to
    develop the notion of system-of-rules (higher-level rules).

*** Limiting ourselves to N3 formulas might be fine
    There are limitations in the use of inference rules instead of
    formulas and going beyond N3 seems to be pushing hard against the
    limitation of inference rules (scope of schematic variables, etc).
    Such a restriction is similar to what Ciabattoni & Genco do.

*** We should resist doing the following in the planned paper

 1. Avoid using the floor/ceiling approach to encoding inference
    rules used in the Pimentel & Nigam & Miller papers.

 2. Avoid trying to answer the question: what is a full blown
    notational system for encoding inference rules for a
    quantificational logic involving higher-level rules.  Instead, we
    rely on the focusing proof systems to generate the rules that we
    need within the paper.

** Address full features of first-order logic
   - classical and intuitionistic logics
   - additive and multiplicative connectives
   - propositional and quantificational logics (care with eigenvariables)
   - do sequents have zone? bounded/unbounded zone?
   - forward vs backward chaining

** Schematic variables
    I think we must determine the shape of the synthetic rule based
    on schematic variables and not their possible instantiations.

    Prefix schematic axioms with =forall-= or =forall+= to determine the
    polarity of prop/predicate variables in their scope. These are not
    real quantifiers.
** Examples
