html/system-rules.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-11-08 Fri 17:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>System of Rules: notes</title>
<meta name="author" content="Dale Miller" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="mystyle.css" />


</head>
<body>
<div id="content" class="content">
<h1 class="title">System of Rules: notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc6b2b37">1. Outline of paper</a>
<ul>
<li><a href="#orgab10813">1.1. Motivation</a></li>
<li><a href="#org457316a">1.2. Prior related work</a></li>
<li><a href="#org01f6e06">1.3. Use focusing, but this time, go beyond bipoles</a>
<ul>
<li><a href="#org948213a">1.3.1. Fix on LJF and LKF</a></li>
<li><a href="#org37ba28e">1.3.2. Storage includes non-atomic formulas</a></li>
<li><a href="#org84b4277">1.3.3. Limiting ourselves to N3 formulas might be fine</a></li>
<li><a href="#orgceef08a">1.3.4. We should resist doing the following in the planned paper</a></li>
</ul>
</li>
<li><a href="#org8873453">1.4. Address full features of first-order logic</a></li>
<li><a href="#org14a4f09">1.5. Schematic variables</a></li>
<li><a href="#org1052686">1.6. Examples</a>
<ul>
<li><a href="#org011c5b4">1.6.1. Higher-level of rules in natural deduction (this is well known)</a></li>
<li><a href="#org2f2ca99">1.6.2. Example: Idenity rules (repeat and cut)</a></li>
<li><a href="#org9394250">1.6.3. Example: Peirce's formula and Gabbay's restart rule</a></li>
<li><a href="#org7b89372">1.6.4. Example: The excluded middle</a></li>
<li><a href="#org751ab52">1.6.5. Example: focusing on formulas that do not have schema variables</a></li>
<li><a href="#org52df26c">1.6.6. When all schema variables have negative polarity</a></li>
<li><a href="#org8a3f1f0">1.6.7. Remember the "killing of premises" in Parigot's free deduction</a></li>
</ul>
</li>
<li><a href="#orgf34bf07">1.7. Deal with first-order quantification</a>
<ul>
<li><a href="#orge2afa4f">1.7.1. Goedel-Dummett Logic</a></li>
<li><a href="#orgd1d97ec">1.7.2. Examples from mathematics of non-geometric formulas</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf977117">2. ToDo list</a></li>
<li><a href="#org0f02656">3. Other possibily related topics</a>
<ul>
<li><a href="#org8c5882b">3.1. Do we talk about hypersequents?</a></li>
<li><a href="#org3286db1">3.2. Do we discussion and comparison with devices to "bipolarize" formulas</a>
<ul>
<li><a href="#org4576a9c">3.2.1. Tseitin constants and Andreoli's skolemization</a></li>
<li><a href="#orgfe428da">3.2.2. Transforming general theories to geometric theories</a></li>
<li><a href="#org52e1f8e">3.2.3. Use of "index" when storing formulas in the FPC framework</a></li>
</ul>
</li>
<li><a href="#orge6d9fe4">3.3. Thoughts when reading a recent paper</a></li>
<li><a href="#orgfcafbe5">3.4. Meeting with Revantha 2 July 2024</a></li>
<li><a href="#orgb86271a">3.5. Connections might exist with the following topics.</a></li>
</ul>
</li>
<li><a href="#org902961c">4. History of this document</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgc6b2b37" class="outline-2">
<h2 id="orgc6b2b37"><span class="section-number-2">1.</span> Outline of paper</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgab10813" class="outline-3">
<h3 id="orgab10813"><span class="section-number-3">1.1.</span> Motivation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
There is an interest in removing formulas with their many logical
connectives and introduction rules with simple inference rules.
</p>

<p>
There are limitations to that effort.  It has been formalized well
in natural deduction (LF, PS-H).  In sequent calculus (which can be
seen as subsuming the natded setting), is more complex.  There are
more structures to witness: additive/multiplicative, pos/neg
polarity of connectives and atomic formulas, bounded/unbounded
zones in sequents, etc.
</p>

<p>
We will attempt to capture many of these features also in inference
rules, although this will require us to extend the syntax of
inference rules.  We will probably also limit ourselves to N3
formulas: higher-levels of polarity nesting is possible but that
would probably strain the nature of inference rules too much.
</p>

<p>
We use focusing to describe the general setting.
</p>
</div>
</div>

<div id="outline-container-org457316a" class="outline-3">
<h3 id="org457316a"><span class="section-number-3">1.2.</span> Prior related work</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>PS-H's paper on a natural extension to ND.</li>
<li>Aaron's "Gentzenizing Schroeder-Heister".</li>
<li>Harper, Honsell, Plotkin. LF.</li>
<li>Negri and others (axioms to inference rules)</li>
<li>Ciabattoni and Genco, ToCL 2018, "Hypersequents and Systems of
Rules: Embeddings and Applications".  Elaine says that they
show transformations between
<ul class="org-ul">
<li>Hypersequents &lt;-&gt; 
System of rules in Sequent calculus &lt;-&gt;
Natural Deduction.</li>
</ul></li>
<li>Ciabattoni, Galatos, Terui: From Axioms to Analytic Rules in
Nonclassical Logics. LICS 2008: Structural rules and the
polarity hierarchy.</li>
</ul>
</div>
</div>
<div id="outline-container-org01f6e06" class="outline-3">
<h3 id="org01f6e06"><span class="section-number-3">1.3.</span> Use focusing, but this time, go beyond bipoles</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org948213a" class="outline-4">
<h4 id="org948213a"><span class="section-number-4">1.3.1.</span> Fix on LJF and LKF</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Stress that cut elimination results can follow automatically for
correctly designed proof systems.  Discussing the cut rule is very
important in this abstract.
</p>

<p>
WARNING Given the use of higher-order-like quantification, we
might not have the subformula property even when we technically
have cut-free proofs.  See notes below from meeting with Revantha.
</p>

<p>
Observations to make explicitly (about nesting of polarities)
</p>

<ol class="org-ol">
<li>If we decide on a formula in N<sub>n</sub> then the asynchronous phase
deals with formulas in P<sub>(n-1)</sub> and we finally get formulas
stored in N<sub>(n-2)</sub>.  In particular, if we decide on Horn clauses
(N<sub>1</sub>) then no formulas are stored: there is no changes to the
LHS.</li>

<li>If B has only implications, then B is of order n (in the
type-theory sense) then B is in B<sub>n</sub>.</li>
</ol>
</div>
</div>

<div id="outline-container-org37ba28e" class="outline-4">
<h4 id="org37ba28e"><span class="section-number-4">1.3.2.</span> Storage includes non-atomic formulas</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
Usually, decide rules on the underlying theory or on stored atomic
formulas.  Now, there will be stored formulas which will yield
inference rules of their own.  Given the formula-as-rule analogy
(avoid saying axiom-as-rule), then it is natural and immediate to
develop the notion of system-of-rules (higher-level rules).
</p>
</div>
</div>

<div id="outline-container-org84b4277" class="outline-4">
<h4 id="org84b4277"><span class="section-number-4">1.3.3.</span> Limiting ourselves to N3 formulas might be fine</h4>
<div class="outline-text-4" id="text-1-3-3">
<p>
There are limitations in the use of inference rules instead of
formulas and going beyond N3 seems to be pushing hard against the
limitation of inference rules (scope of schematic variables, etc).
Such a restriction is similar to what Ciabattoni &amp; Genco do.
</p>
</div>
</div>

<div id="outline-container-orgceef08a" class="outline-4">
<h4 id="orgceef08a"><span class="section-number-4">1.3.4.</span> We should resist doing the following in the planned paper</h4>
<div class="outline-text-4" id="text-1-3-4">
<ol class="org-ol">
<li>Avoid using the floor/ceiling approach to encoding inference
rules used in the Pimentel &amp; Nigam &amp; Miller papers.</li>

<li>Avoid trying to answer the question: what is a full blown
notational system for encoding inference rules for a
quantificational logic involving higher-level rules.  Instead, we
rely on the focusing proof systems to generate the rules that we
need within the paper.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org8873453" class="outline-3">
<h3 id="org8873453"><span class="section-number-3">1.4.</span> Address full features of first-order logic</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>classical and intuitionistic logics</li>
<li>additive and multiplicative connectives</li>
<li>propositional and quantificational logics (care with eigenvariables)</li>
<li>do sequents have zone? bounded/unbounded zone?</li>
<li>forward vs backward chaining</li>
</ul>
</div>
</div>

<div id="outline-container-org14a4f09" class="outline-3">
<h3 id="org14a4f09"><span class="section-number-3">1.5.</span> Schematic variables</h3>
<div class="outline-text-3" id="text-1-5">
<p>
I think we must determine the shape of the synthetic rule based
on schematic variables and not their possible instantiations.
</p>

<p>
Prefix schematic axioms with <code>forall-</code> or <code>forall+</code> to determine the
polarity of prop/predicate variables in their scope. These are not
real quantifiers.
</p>
</div>
</div>
