system-rules.org
*** Higher-level of rules in natural deduction (this is well known)
    Focused sequent calculus for intuitionistic logic (negative
    connectives) is natural deduction.  This claim needs to be
    confirmed again.  The distinction between additive and
    multiplicate inference rules disappears since the LHS is unbounded
    (treated additively even with multiplicative rules) and the RHS is
    bounded but only a singleton.

    Hence, we can say that if we limit ourselves to intuitionistic
    sequents (hence, LHS is unbounded, RHS is bounded), negative polarity 
    connections only (imp, forall, additive conjunction) and for
    atoms (hence, backchaining), then we have a presentation of
    natural deduction with synthetic rules.

    The propositional fragment is treated by PSH.

    The LF proof system treats full first-order quantification.

    We should show that higher-level rules in our general setting just
    become the rules intended in the PSH and LF systems.

    Various papers by Herbelin, Espirito Santo, etc, show the
    connections between typed lambda-terms and LJT.


*** Example: Idenity rules (repeat and cut)
    Consider the higher-order formulas =(forall p, p -> p)=.
    - If we use either =(forall- p, p -> p)= or =(forall+ p, p -> p)=, we
      get two versions of the repeat inference rule below (respectively).

#+BEGIN_EXAMPLE
      Gamma |- p        Gamma, p |- E
      -----------       --------------
      Gamma |- p        Gamma, p |- E
#+END_EXAMPLE
    - If we introduce a delay, then we have the cut rule. That is, the
      formula =(forall+ p, (top -> p) -> p)= yields the cut rule as a
      synthetic rules.

*** Example: Peirce's formula and Gabbay's restart rule
     Peirce's law: =forall phi, forall theta, (( phi -> theta) -> phi) -> phi=
     
     If phi and theta are negative bias, then we have the restart
     rule.
#+BEGIN_EXAMPLE
	  Delta |- phi
	  ==============
	  Delta |- theta
	        .
	        .
	        .
	  Gamma |- phi
	  ============
	  Gamma |- phi
#+END_EXAMPLE
      If phi is negative and theta is positive then we have 
#+BEGIN_EXAMPLE
       Delta |- phi   Delta, theta |- E
       ================================
               Delta |- E
  	             .
  	             .
  	             .
  	       Gamma |- phi
  	       ============
    	       Gamma |- phi
#+END_EXAMPLE
     This latter rule is a bit odd.  Since theta could be anything, we
     can take it to be false, so the right premise is finished.  In
     any case, the right premise is not needed, since =Delta |- phi=
     will yield =Gamma |- phi= in the usual monotonic setting were =Gamma=
     is contained in =Delta=.

*** Example: The excluded middle
See Elaine's main.tex for this example (probably pos polarity atoms).
#+BEGIN_EXAMPLE
      forall- phi, delay- (phi \/ (phi -> zero)) 
#+END_EXAMPLE
     We need the delay since we want the excluded middle to be stored
     for use at some future time.
#+BEGIN_EXAMPLE
     Psi, p |- E           Upsilon |- p
    =============          ============
        Psi |- E           Upsilon |- B
             .                     .
             .                     .
             .                     .
       Gamma |- Delta        Gamma |- Delta 
       ====================================
                  Gamma |- Delta
#+END_EXAMPLE
   Thus, we can use strengthening on the same formula on the left (on
   the left premise) and on the right (on the right premise) for the
   same formula.
*** Example: focusing on formulas that do not have schema variables
     - one oplus one - yields "superposition"
     - one par one - yields mix, but only works with classical
       logic. The usual presentation of mix is as an inference rule
       that proves the formula one par one.  Here, we have the
       converse: if you accept these formulas as axioms, you get the
       inference rules.  See https://www.pls-lab.org/en/Mix_rule.

   See the discussion in the brief abstract by
   Mario Piazza & Gabriele Pulcini: On the maximality of classical logic
   at https://ls.cs.uni-tuebingen.de/GPT/abstracts.xhtml
   The Post Completeness result concerns whether or not a token is a
   constant or a schema variable.
*** When all schema variables have negative polarity
    They we can start to emulate PS-H natural extension of natural
    deduction.  However, if we use positive polarity schema variables,
    the natural deduction setting is not so direct.

    Define "barb" as I did once before in the MMPV paper.  When we use
    negative schema variables, there will be exactly one member of the
    barb and it is the RHS of a sequent.  This leads to a natural
    encoding in natural deduction.  Otherwise, a positive bias is
    interesting and useful but this does not lend itself to a natural
    deduction approach.

*** Remember the "killing of premises" in Parigot's free deduction
     and the "standing proud" premises of Niel Tennant (See
     "Autologic" Chapter 5, page 41).  Is there a relationship with
     our notions of schematic variables and their polarity?

** Deal with first-order quantification
    Make the eigenvariable signature of rules explicit.

    How to treat the quantifier introduction rules.

*** Goedel-Dummett Logic
    Example: treat completely the Goedel-Dummett logic for first-order logic
#+BEGIN_EXAMPLE
    Axiom 1: (P => Q) \/ (Q => P).                        Linearity
    Axiom 2: forall x (A x \/ B) => forall x (A x) \/ B.  Quantifier shift
#+END_EXAMPLE

  By focusing on Axiom 1, it seems that we can come up with the right
  2-system formulation.  Using the Ciabattoni & Genco result, we get
  the com rule for hypersequents.

  We should next focus on Axiom 2 to see what it means for 2-systems
  and then for hypersequents.

  First quess: The sequents in a hypersequent carry their own local
  sequents.  A "com-like" rule would also an eigenvariable from one
  sequent to get added to another sequent's signature.

   - Is this the correct rule for GD logic?
   - How does this rule get motivated by focusing on Axiom 2?

*** Examples from mathematics of non-geometric formulas
    Eg, the lub example developed in the ProofSociety slides
* ToDo list
  - Getting a treatment of first-order rules, especially the
    quantifier shift for Goedel-Dummett logic should be done next.
  - Describing and justifying the scope of any new bindings for
    inference rules and schematic variables should be considered early
    on.
* Other possibily related topics
** Do we talk about hypersequents?
