html/system-rules.html
<div id="outline-container-org1052686" class="outline-3">
<h3 id="org1052686"><span class="section-number-3">1.6.</span> Examples</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org011c5b4" class="outline-4">
<h4 id="org011c5b4"><span class="section-number-4">1.6.1.</span> Higher-level of rules in natural deduction (this is well known)</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Focused sequent calculus for intuitionistic logic (negative
connectives) is natural deduction.  This claim needs to be
confirmed again.  The distinction between additive and
multiplicate inference rules disappears since the LHS is unbounded
(treated additively even with multiplicative rules) and the RHS is
bounded but only a singleton.
</p>

<p>
Hence, we can say that if we limit ourselves to intuitionistic
sequents (hence, LHS is unbounded, RHS is bounded), negative polarity 
connections only (imp, forall, additive conjunction) and for
atoms (hence, backchaining), then we have a presentation of
natural deduction with synthetic rules.
</p>

<p>
The propositional fragment is treated by PSH.
</p>

<p>
The LF proof system treats full first-order quantification.
</p>

<p>
We should show that higher-level rules in our general setting just
become the rules intended in the PSH and LF systems.
</p>

<p>
Various papers by Herbelin, Espirito Santo, etc, show the
connections between typed lambda-terms and LJT.
</p>
</div>
</div>


<div id="outline-container-org2f2ca99" class="outline-4">
<h4 id="org2f2ca99"><span class="section-number-4">1.6.2.</span> Example: Idenity rules (repeat and cut)</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
Consider the higher-order formulas <code>(forall p, p -&gt; p)</code>.
</p>
<ul class="org-ul">
<li>If we use either <code>(forall- p, p -&gt; p)</code> or <code>(forall+ p, p -&gt; p)</code>, we
get two versions of the repeat inference rule below (respectively).</li>
</ul>

<pre class="example" id="org1bcf6a1">
Gamma |- p        Gamma, p |- E
-----------       --------------
Gamma |- p        Gamma, p |- E
</pre>
<ul class="org-ul">
<li>If we introduce a delay, then we have the cut rule. That is, the
formula <code>(forall+ p, (top -&gt; p) -&gt; p)</code> yields the cut rule as a
synthetic rules.</li>
</ul>
</div>
</div>

<div id="outline-container-org9394250" class="outline-4">
<h4 id="org9394250"><span class="section-number-4">1.6.3.</span> Example: Peirce's formula and Gabbay's restart rule</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
Peirce's law: <code>forall phi, forall theta, (( phi -&gt; theta) -&gt; phi) -&gt; phi</code>
</p>

<p>
If phi and theta are negative bias, then we have the restart
rule.
</p>
<pre class="example" id="org0e36242">
Delta |- phi
==============
Delta |- theta
      .
      .
      .
Gamma |- phi
============
Gamma |- phi
</pre>
<p>
If phi is negative and theta is positive then we have 
</p>
<pre class="example" id="org91431e1">
Delta |- phi   Delta, theta |- E
================================
        Delta |- E
  	      .
  	      .
  	      .
  	Gamma |- phi
  	============
    	Gamma |- phi
</pre>
<p>
This latter rule is a bit odd.  Since theta could be anything, we
can take it to be false, so the right premise is finished.  In
any case, the right premise is not needed, since <code>Delta |- phi</code>
will yield <code>Gamma |- phi</code> in the usual monotonic setting were <code>Gamma</code>
is contained in <code>Delta</code>.
</p>
</div>
</div>

<div id="outline-container-org7b89372" class="outline-4">
<h4 id="org7b89372"><span class="section-number-4">1.6.4.</span> Example: The excluded middle</h4>
<div class="outline-text-4" id="text-1-6-4">
<p>
See Elaine's main.tex for this example (probably pos polarity atoms).
</p>
<pre class="example" id="org1944af2">
forall- phi, delay- (phi \/ (phi -&gt; zero)) 
</pre>
<p>
We need the delay since we want the excluded middle to be stored
for use at some future time.
</p>
<pre class="example" id="orgb18c988">
 Psi, p |- E           Upsilon |- p
=============          ============
    Psi |- E           Upsilon |- B
         .                     .
         .                     .
         .                     .
   Gamma |- Delta        Gamma |- Delta 
   ====================================
              Gamma |- Delta
</pre>
<p>
Thus, we can use strengthening on the same formula on the left (on
the left premise) and on the right (on the right premise) for the
same formula.
</p>
</div>
</div>
<div id="outline-container-org751ab52" class="outline-4">
<h4 id="org751ab52"><span class="section-number-4">1.6.5.</span> Example: focusing on formulas that do not have schema variables</h4>
<div class="outline-text-4" id="text-1-6-5">
<ul class="org-ul">
<li>one oplus one - yields "superposition"</li>
<li>one par one - yields mix, but only works with classical
logic. The usual presentation of mix is as an inference rule
that proves the formula one par one.  Here, we have the
converse: if you accept these formulas as axioms, you get the
inference rules.  See <a href="https://www.pls-lab.org/en/Mix_rule">https://www.pls-lab.org/en/Mix_rule</a>.</li>
</ul>

<p>
See the discussion in the brief abstract by
Mario Piazza &amp; Gabriele Pulcini: On the maximality of classical logic
at <a href="https://ls.cs.uni-tuebingen.de/GPT/abstracts.xhtml">https://ls.cs.uni-tuebingen.de/GPT/abstracts.xhtml</a>
The Post Completeness result concerns whether or not a token is a
constant or a schema variable.
</p>
</div>
</div>
<div id="outline-container-org52df26c" class="outline-4">
<h4 id="org52df26c"><span class="section-number-4">1.6.6.</span> When all schema variables have negative polarity</h4>
<div class="outline-text-4" id="text-1-6-6">
<p>
They we can start to emulate PS-H natural extension of natural
deduction.  However, if we use positive polarity schema variables,
the natural deduction setting is not so direct.
</p>

<p>
Define "barb" as I did once before in the MMPV paper.  When we use
negative schema variables, there will be exactly one member of the
barb and it is the RHS of a sequent.  This leads to a natural
encoding in natural deduction.  Otherwise, a positive bias is
interesting and useful but this does not lend itself to a natural
deduction approach.
</p>
</div>
</div>

<div id="outline-container-org8a3f1f0" class="outline-4">
<h4 id="org8a3f1f0"><span class="section-number-4">1.6.7.</span> Remember the "killing of premises" in Parigot's free deduction</h4>
<div class="outline-text-4" id="text-1-6-7">
<p>
and the "standing proud" premises of Niel Tennant (See
"Autologic" Chapter 5, page 41).  Is there a relationship with
our notions of schematic variables and their polarity?
</p>
</div>
</div>
</div>

<div id="outline-container-orgf34bf07" class="outline-3">
<h3 id="orgf34bf07"><span class="section-number-3">1.7.</span> Deal with first-order quantification</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Make the eigenvariable signature of rules explicit.
</p>

<p>
How to treat the quantifier introduction rules.
</p>
</div>

<div id="outline-container-orge2afa4f" class="outline-4">
<h4 id="orge2afa4f"><span class="section-number-4">1.7.1.</span> Goedel-Dummett Logic</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
Example: treat completely the Goedel-Dummett logic for first-order logic
</p>
<pre class="example" id="org8d87b64">
Axiom 1: (P =&gt; Q) \/ (Q =&gt; P).                        Linearity
Axiom 2: forall x (A x \/ B) =&gt; forall x (A x) \/ B.  Quantifier shift
</pre>

<p>
By focusing on Axiom 1, it seems that we can come up with the right
2-system formulation.  Using the Ciabattoni &amp; Genco result, we get
the com rule for hypersequents.
</p>

<p>
We should next focus on Axiom 2 to see what it means for 2-systems
and then for hypersequents.
</p>

<p>
First quess: The sequents in a hypersequent carry their own local
sequents.  A "com-like" rule would also an eigenvariable from one
sequent to get added to another sequent's signature.
</p>

<ul class="org-ul">
<li>Is this the correct rule for GD logic?</li>
<li>How does this rule get motivated by focusing on Axiom 2?</li>
</ul>
</div>
</div>

<div id="outline-container-orgd1d97ec" class="outline-4">
<h4 id="orgd1d97ec"><span class="section-number-4">1.7.2.</span> Examples from mathematics of non-geometric formulas</h4>
<div class="outline-text-4" id="text-1-7-2">
<p>
Eg, the lub example developed in the ProofSociety slides
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf977117" class="outline-2">
<h2 id="orgf977117"><span class="section-number-2">2.</span> ToDo list</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Getting a treatment of first-order rules, especially the
quantifier shift for Goedel-Dummett logic should be done next.</li>
<li>Describing and justifying the scope of any new bindings for
inference rules and schematic variables should be considered early
on.</li>
</ul>
</div>
</div>
<div id="outline-container-org0f02656" class="outline-2">
<h2 id="org0f02656"><span class="section-number-2">3.</span> Other possibily related topics</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org8c5882b" class="outline-3">
<h3 id="org8c5882b"><span class="section-number-3">3.1.</span> Do we talk about hypersequents?</h3>
</div>
