system-rules.org
** Do we discussion and comparison with devices to "bipolarize" formulas
   Seems that there are two reasons to introduce names.  Sometimes
   they are used to name all subformulas for various reasons.
   (Harrison's book on CNF and recent papers on PTS).
*** Tseitin constants and Andreoli's skolemization

    Introduce new non-logical constants to define and remove subformulas
    so that the alternation of polarities diminishes.

    This has many names and has been studied and used in many papers
    - Tseitin [1960’s]
    - Andreoli: skolemization [1992], bipolarization [2001]
    - Dyckhoff & Negri: geometrisation [2015]
    - Mints et al. [1982]
    - Mint's resolution calculus: Link this with the FPC notion of
      index.  See the slides of Roy Dyckhoff at
      "~/Dropbox/People/R/RoyDyckhoff/Proof systems for intuitionistic
      logic 2008 talk.pdf" Especially when he speaks of the resolution
      calculus of Mints (starting on slide 28).  This looks very much
      like choosing to polarize so that lots of delays are inserted.
      Such delays should invoke a store which comes with a label.
      These labels would play the role of Tseitin constants (maybe
      Mints does not use that term).
    - Mint's article is a chapter in "~/Dropbox/Books/Constraint
      Programming (NATO ASI Series 131) eds Mayoh, Tyugu, Uustalu,
      Mayoh, Tyugu, Penjam.pdf"
    - DM has some notes on Tseitin/Skolemization in his Projects.org
      file.  I have lots of notes there that might be related to this
      project.
*** Transforming general theories to geometric theories
    Overview paper by Dyckhoff and Negri.
*** Use of "index" when storing formulas in the FPC framework
    These indexes are part of the proof structure and not part of the
    logic.  These are not constants for which models need to be
    constructed.

    In the FPC setting, we have an explicit naming device (indexes)
    for formulas that are stored.  These names are proof theoretic
    devices only and should not be considered part of the semantics of
    formulas.  That is, we might give a stored formula the index =(lub
    x y z)= and later when we do a decide, we can use the formula
    associated to that index.  At the same time, that index is not in
    the formula so it does not need to be given a model theoretic
    semantics... (as is done in the Dyckhoff & Negri paper).

    This discussion reminds me of the use of Skolem functions in
    higher-order logic.  These Skolem functions can be considered as
    real functions, but then you prove instances of the axiom of
    choice.  Instead, Skolem functions are more a linguistic device
    for naming eigenvariables.

** Thoughts when reading a recent paper
   "Proof-theoretic Semantics for Intuitionistic Multiplicative Linear
   Logic" by Alexander V. Gheorghiu , Tao Gu and David J. Pym

   - The use of names to name every subformula - used by Sandqvist's
     proof of completeness (Theorem 1 and its proof).  This reminds me
     of Mints's resolution method and my use of indexes in FPCs.
   - Corollary 3, where it seems that a meta-level quantifier is
     reduced to a quantifier on atomic formulas.  Seems to be a
     regular theme.  (Neat proof of this corollary.)
** Meeting with Revantha 2 July 2024
   KC and RR and I discussed several things this afternoon.
   - I should make sure that when we use axioms such as
       (forall p, q. (p -> q) \/ (q -> p))
     that we can limit it to subformulas only.
   - However, using the axiom (forall p, p -> p) gives rise to the cut
     rule and this is not generally expected to be limited to
     subformulas (analytic cuts).

   1. check RR's technical results about "restricted cuts".  See:
      Agata Ciabattoni, Timo Lang, Revantha Ramanayake:
      Cut-Restriction: From Cuts to Analytic Cuts. LICS 2023: 1-13.
   2. Bounded-analytic sequent calculi and embeddings for hypersequent
      logics, by Agata Ciabattoni1, Timo Lang, and Revantha Ramanayake
      2024 (see RR's dropbox).
** Connections might exist with the following topics.
   - Russell-Prawitz translation: See papers by Luiz Carlos Pereira on
     this topic.
   - FAT: rules where schematic variables can be restricted to atomic formulas
     Paulo Olivia, Guida, etc.  See arXiv.
* History of this document

  - Incorporates the file: notes-after-discussion-25-09-2024.org
  - DM and EP discussed most of this on 8 Nov 2024.

#+TITLE: System of Rules: notes
#+AUTHOR: Dale Miller
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="mystyle.css" />

#+OPTIONS: toc:t
#+INFOJS_OPT: view:content toc:t ltoc:nil path:./org-info.js
#+bind: org-export-allow-bind-keywords t

# Local Variables:
# org-export-html-style: "<link rel=\"stylesheet\" type=\"text/css\" href=\"mystyle.css\" />"
# org-export-allow-bind-keywords: t
# End:

#+BEGIN_COMMENT
INFOJS_OPT: view:overview toc:t ltoc:t path:../Sync/Exports/org-info.js
bind: org-export-publishing-directory "~/Dropbox/Sync/Exports/"
#+END_COMMENT
