html/system-rules.html
<div id="outline-container-org3286db1" class="outline-3">
<h3 id="org3286db1"><span class="section-number-3">3.2.</span> Do we discussion and comparison with devices to "bipolarize" formulas</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Seems that there are two reasons to introduce names.  Sometimes
they are used to name all subformulas for various reasons.
(Harrison's book on CNF and recent papers on PTS).
</p>
</div>
<div id="outline-container-org4576a9c" class="outline-4">
<h4 id="org4576a9c"><span class="section-number-4">3.2.1.</span> Tseitin constants and Andreoli's skolemization</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Introduce new non-logical constants to define and remove subformulas
so that the alternation of polarities diminishes.
</p>

<p>
This has many names and has been studied and used in many papers
</p>
<ul class="org-ul">
<li>Tseitin [1960’s]</li>
<li>Andreoli: skolemization [1992], bipolarization [2001]</li>
<li>Dyckhoff &amp; Negri: geometrisation [2015]</li>
<li>Mints et al. [1982]</li>
<li>Mint's resolution calculus: Link this with the FPC notion of
index.  See the slides of Roy Dyckhoff at
"~/Dropbox/People/R/RoyDyckhoff/Proof systems for intuitionistic
logic 2008 talk.pdf" Especially when he speaks of the resolution
calculus of Mints (starting on slide 28).  This looks very much
like choosing to polarize so that lots of delays are inserted.
Such delays should invoke a store which comes with a label.
These labels would play the role of Tseitin constants (maybe
Mints does not use that term).</li>
<li>Mint's article is a chapter in "~/Dropbox/Books/Constraint
Programming (NATO ASI Series 131) eds Mayoh, Tyugu, Uustalu,
Mayoh, Tyugu, Penjam.pdf"</li>
<li>DM has some notes on Tseitin/Skolemization in his Projects.org
file.  I have lots of notes there that might be related to this
project.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfe428da" class="outline-4">
<h4 id="orgfe428da"><span class="section-number-4">3.2.2.</span> Transforming general theories to geometric theories</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
Overview paper by Dyckhoff and Negri.
</p>
</div>
</div>
<div id="outline-container-org52e1f8e" class="outline-4">
<h4 id="org52e1f8e"><span class="section-number-4">3.2.3.</span> Use of "index" when storing formulas in the FPC framework</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
These indexes are part of the proof structure and not part of the
logic.  These are not constants for which models need to be
constructed.
</p>

<p>
In the FPC setting, we have an explicit naming device (indexes)
for formulas that are stored.  These names are proof theoretic
devices only and should not be considered part of the semantics of
formulas.  That is, we might give a stored formula the index <code>(lub
    x y z)</code> and later when we do a decide, we can use the formula
associated to that index.  At the same time, that index is not in
the formula so it does not need to be given a model theoretic
semantics&#x2026; (as is done in the Dyckhoff &amp; Negri paper).
</p>

<p>
This discussion reminds me of the use of Skolem functions in
higher-order logic.  These Skolem functions can be considered as
real functions, but then you prove instances of the axiom of
choice.  Instead, Skolem functions are more a linguistic device
for naming eigenvariables.
</p>
</div>
</div>
</div>

<div id="outline-container-orge6d9fe4" class="outline-3">
<h3 id="orge6d9fe4"><span class="section-number-3">3.3.</span> Thoughts when reading a recent paper</h3>
<div class="outline-text-3" id="text-3-3">
<p>
"Proof-theoretic Semantics for Intuitionistic Multiplicative Linear
Logic" by Alexander V. Gheorghiu , Tao Gu and David J. Pym
</p>

<ul class="org-ul">
<li>The use of names to name every subformula - used by Sandqvist's
proof of completeness (Theorem 1 and its proof).  This reminds me
of Mints's resolution method and my use of indexes in FPCs.</li>
<li>Corollary 3, where it seems that a meta-level quantifier is
reduced to a quantifier on atomic formulas.  Seems to be a
regular theme.  (Neat proof of this corollary.)</li>
</ul>
</div>
</div>
<div id="outline-container-orgfcafbe5" class="outline-3">
<h3 id="orgfcafbe5"><span class="section-number-3">3.4.</span> Meeting with Revantha 2 July 2024</h3>
<div class="outline-text-3" id="text-3-4">
<p>
KC and RR and I discussed several things this afternoon.
</p>
<ul class="org-ul">
<li>I should make sure that when we use axioms such as
  (forall p, q. (p -&gt; q) \/ (q -&gt; p))
that we can limit it to subformulas only.</li>
<li>However, using the axiom (forall p, p -&gt; p) gives rise to the cut
rule and this is not generally expected to be limited to
subformulas (analytic cuts).</li>

<li>check RR's technical results about "restricted cuts".  See:
Agata Ciabattoni, Timo Lang, Revantha Ramanayake:
Cut-Restriction: From Cuts to Analytic Cuts. LICS 2023: 1-13.</li>
<li>Bounded-analytic sequent calculi and embeddings for hypersequent
logics, by Agata Ciabattoni1, Timo Lang, and Revantha Ramanayake
2024 (see RR's dropbox).</li>
</ul>
</div>
</div>
<div id="outline-container-orgb86271a" class="outline-3">
<h3 id="orgb86271a"><span class="section-number-3">3.5.</span> Connections might exist with the following topics.</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Russell-Prawitz translation: See papers by Luiz Carlos Pereira on
this topic.</li>
<li>FAT: rules where schematic variables can be restricted to atomic formulas
Paulo Olivia, Guida, etc.  See arXiv.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org902961c" class="outline-2">
<h2 id="org902961c"><span class="section-number-2">4.</span> History of this document</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Incorporates the file: notes-after-discussion-25-09-2024.org</li>
<li>DM and EP discussed most of this on 8 Nov 2024.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dale Miller</p>
<p class="date">Created: 2024-11-08 Fri 17:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
